work/vagrant/Bookers2/app/controllers/books_controller.rb

  def create
    # ストロングパラメーターを使用
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    # DBへ保存する
    if @book.save
    #   redirect_to book_path(@book.id) , notice: 'Book was successfully created'
    # else
    # # @books = Book.all
    # # @user = User.find(params[:id])
    # # @book = Book.new
    # # render "index"
    #   # redirect_to books_path
    # end
    # redirect_to book_path(@book.id), notice: 'Book was successfully created.'
    # @book = Book.new(book_params)
    redirect_to book_path(@book.id) , notice: 'Book was successfully created'


    else
      @books =Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "tset"], ["user_id", "1"], ["created_at", "2020-08-03 16:31:49.961443"], ["updated_at", "2020-08-03 16:31:49.961443"]]
SELECT "books".* FROM "books"

  def index
    if user_signed_in?
    @books = Book.all
---
SELECT "books".* FROM "books"

  def show
    if user_signed_in?
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit

    if @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]