work/vagrant/Bookers2/app/controllers/users_controller.rb

  def index
    if user_signed_in?
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    if user_signed_in?

    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    # @user = User.find(params[:id])

    # if current_user.id != @user.id
    #   redirect_to users_path
    # elsif user_signed_in? == false
    #   redirect_to new_user_session_path


    # end

    if @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]